{
  "topics": [
    {
      "title": "Предел функции",
      "content": "Предел функции f(x) при x → a (конечный или бесконечный) характеризует поведение функции вблизи точки a. Определение на языке ε-δ: ∀ε>0 ∃δ>0: 0<|x-a|<δ ⇒ |f(x)-L|<ε. Односторонние пределы. Свойства пределов: арифметические операции, предел композиции. Замечательные пределы: lim sin x / x = 1, lim (1+1/x)^x = e.",
      "keywords": ["предел", "непрерывность", "эпсилон-дельта", "замечательные пределы"]
    },
    {
      "title": "Непрерывность функции",
      "content": "Функция непрерывна в точке a, если lim f(x) при x→a = f(a). Классификация точек разрыва: устранимый, скачок, разрыв второго рода. Свойства непрерывных функций: теорема Больцано-Коши о промежуточных значениях, теорема Вейерштрасса о достижении экстремумов на отрезке.",
      "keywords": ["непрерывность", "разрыв", "теорема больцано", "вейерштрасс"]
    },
    {
      "title": "Производная",
      "content": "Производная функции f(x) в точке x0 определяется как f'(x0) = lim (f(x0+Δx)-f(x0))/Δx при Δx→0. Геометрический смысл: угловой коэффициент касательной. Правила дифференцирования: производная суммы, произведения, частного, сложной функции (цепное правило). Таблица производных основных функций. Производные высших порядков.",
      "keywords": ["производная", "дифференцирование", "касательная", "цепное правило"]
    },
    {
      "title": "Приложения производной",
      "content": "Исследование функций: монотонность (f' > 0 ⇒ возрастает), экстремумы (критические точки, первая и вторая производная), выпуклость (f'' > 0 ⇒ вогнутость вверх), точки перегиба. Правило Лопиталя для раскрытия неопределённостей. Формула Тейлора с остаточным членом. Задачи на оптимизацию.",
      "keywords": ["экстремум", "монотонность", "лопиталь", "тейлор", "оптимизация"]
    },
    {
      "title": "Неопределённый интеграл",
      "content": "Первообразная F(x) функции f(x) — такая, что F'(x) = f(x). Неопределённый интеграл ∫f(x)dx = F(x) + C. Свойства линейности. Таблица основных интегралов. Методы интегрирования: замена переменной, интегрирование по частям, интегрирование рациональных функций (разложение на простейшие дроби), тригонометрических функций.",
      "keywords": ["первообразная", "неопределённый интеграл", "замена переменной", "интегрирование по частям"]
    },
    {
      "title": "Определённый интеграл",
      "content": "Определённый интеграл ∫ от a до b f(x)dx — предел интегральных сумм Римана. Геометрический смысл: площадь под кривой. Формула Ньютона-Лейбница: ∫ от a до b f(x)dx = F(b)-F(a). Свойства: линейность, аддитивность, оценка интеграла. Несобственные интегралы (бесконечные пределы, разрывы). Приложения: площадь, объём тела вращения, длина дуги, работа переменной силы.",
      "keywords": ["определённый интеграл", "ньютон-лейбниц", "площадь", "несобственный интеграл"]
    },
    {
      "title": "Дифференциальные уравнения",
      "content": "Обыкновенное дифференциальное уравнение (ОДУ) связывает функцию и её производные. Порядок уравнения. Задача Коши. Основные типы: уравнения с разделяющимися переменными, линейные уравнения первого порядка (метод интегрирующего множителя), однородные уравнения, уравнения Бернулли. Линейные уравнения высших порядков с постоянными коэффициентами (однородные и неоднородные).",
      "keywords": ["ду", "дифференциальное уравнение", "коши", "разделение переменных"]
    },
    {
      "title": "Ряды",
      "content": "Числовые ряды: сходимость, необходимый признак, признаки сравнения, Даламбера, Коши, интегральный признак. Знакочередующиеся ряды, признак Лейбница. Степенные ряды: радиус сходимости, ряд Тейлора и Маклорена. Разложение основных функций в ряд. Применение рядов для приближённых вычислений.",
      "keywords": ["ряд", "сходимость", "тейлор", "степенной ряд"]
    }
  ]
}