{
  "topics": [
    {
      "title": "Множества",
      "content": "Множество — это совокупность различных элементов, мыслимая как единое целое. Элементы множества могут быть любой природы: числа, буквы, объекты. Множество обычно обозначают заглавными латинскими буквами, а его элементы — строчными. Если элемент a принадлежит множеству A, пишут a ∈ A, если не принадлежит — a ∉ A. Множество можно задать перечислением элементов в фигурных скобках, например, A = {1, 2, 3} или указанием характеристического свойства: B = {x | x > 0}. Основные понятия: пустое множество ∅, универсальное множество U, подмножество (A ⊆ B), мощность множества |A|.",
      "keywords": ["множество", "элемент", "принадлежность", "подмножество", "пустое множество"]
    },
    {
      "title": "Операции над множествами",
      "content": "Основные операции: объединение (A ∪ B) — множество элементов, принадлежащих хотя бы одному из множеств A или B; пересечение (A ∩ B) — множество элементов, принадлежащих одновременно и A, и B; разность (A \\ B) — элементы A, не принадлежащие B; симметрическая разность (A ∆ B) — элементы, принадлежащие ровно одному из множеств; дополнение (A̅) — все элементы универсума, не принадлежащие A. Свойства: коммутативность, ассоциативность, дистрибутивность, законы де Моргана.",
      "keywords": ["объединение", "пересечение", "разность", "симметрическая разность", "дополнение", "де морган"]
    },
    {
      "title": "Отношения и функции",
      "content": "Бинарным отношением между множествами A и B называется подмножество декартова произведения A × B. Отношение может быть рефлексивным, симметричным, транзитивным (отношение эквивалентности) или антисимметричным, рефлексивным, транзитивным (отношение порядка). Функция (отображение) — это отношение, в котором каждому элементу из A сопоставлен ровно один элемент из B. Виды функций: инъекция, сюръекция, биекция.",
      "keywords": ["отношение", "функция", "инъекция", "сюръекция", "биекция", "эквивалентность"]
    },
    {
      "title": "Комбинаторика",
      "content": "Комбинаторика изучает способы подсчёта числа комбинаций. Основные понятия: перестановки (P(n) = n!), размещения (A(n,k) = n!/(n-k)!), сочетания (C(n,k) = n!/(k!(n-k)!)), бином Ньютона ( (a+b)^n = Σ C(n,k) a^{n-k} b^k ). Правила суммы и произведения. Принцип включения-исключения.",
      "keywords": ["комбинаторика", "перестановки", "размещения", "сочетания", "бином"]
    },
    {
      "title": "Теория графов",
      "content": "Граф — это совокупность вершин и рёбер, соединяющих некоторые пары вершин. Основные понятия: ориентированный/неориентированный граф, степень вершины, путь, цикл, связность, дерево. Эйлеров цикл (проходит каждое ребро ровно один раз), гамильтонов цикл (проходит каждую вершину ровно один раз). Задачи: поиск кратчайшего пути, раскраска графов.",
      "keywords": ["граф", "вершина", "ребро", "эйлеров", "гамильтонов", "дерево"]
    },
    {
      "title": "Булева алгебра",
      "content": "Булева алгебра — это алгебра логики, оперирующая переменными, которые могут принимать значения 0 или 1 (ложь/истина). Основные операции: конъюнкция (∧, И), дизъюнкция (∨, ИЛИ), отрицание (¬, НЕ). Законы: идемпотентности, коммутативности, ассоциативности, дистрибутивности, де Моргана, поглощения. Булевы функции, совершенная дизъюнктивная нормальная форма (СДНФ), совершенная конъюнктивная нормальная форма (СКНФ), минимизация (карты Карно).",
      "keywords": ["булева алгебра", "логика", "сднф", "скнф", "карта карно"]
    },
    {
      "title": "Математическая индукция и рекуррентные соотношения",
      "content": "Математическая индукция — метод доказательства утверждений, зависящих от натурального n. База индукции и индукционный переход. Рекуррентные соотношения — способ задания последовательности, где каждый следующий член выражается через предыдущие. Пример: числа Фибоначчи F(n) = F(n-1) + F(n-2). Решение линейных рекуррентных соотношений с постоянными коэффициентами.",
      "keywords": ["индукция", "рекуррентность", "фибоначчи"]
    }
  ]
}