{
  "topics": [
    {
      "title": "Множества: определения и способы задания",
      "content": "Множество — это фундаментальное понятие математики, обозначающее совокупность различных объектов, объединённых по некоторому признаку. Объекты, входящие в множество, называются элементами. Если элемент a принадлежит множеству A, пишут a ∈ A, в противном случае — a ∉ A.\n\nМножество может быть задано двумя способами:\n1) Перечислением элементов: A = {a1, a2, ..., an}. Например, A = {1, 2, 3}.\n2) Описанием характеристического свойства: B = {x | P(x)}, где P(x) — условие, которому удовлетворяют элементы. Например, B = {x | x ∈ ℕ, x > 0}.\n\nПустое множество ∅ не содержит ни одного элемента. Универсальное множество U содержит все элементы рассматриваемой предметной области.\n\nМножество A называется подмножеством B (A ⊆ B), если каждый элемент A является элементом B. Если A ⊆ B и A ≠ B, то A — собственное подмножество.\n\nМощность множества |A| — число его элементов (для конечных множеств). Для бесконечных множеств вводится понятие счётности.",
      "keywords": ["множество", "элемент", "подмножество", "пустое множество", "универсальное множество", "мощность"]
    },
    {
      "title": "Операции над множествами и их свойства",
      "content": "Основные операции над множествами:\n\n• Объединение A ∪ B = {x | x ∈ A или x ∈ B} — множество элементов, принадлежащих хотя бы одному из множеств.\n• Пересечение A ∩ B = {x | x ∈ A и x ∈ B} — множество элементов, принадлежащих обоим множествам.\n• Разность A \\ B = {x | x ∈ A и x ∉ B} — элементы A, не входящие в B.\n• Симметрическая разность A ∆ B = (A \\ B) ∪ (B \\ A) = {x | x ∈ A или x ∈ B, но не в оба}.\n• Дополнение A̅ = {x ∈ U | x ∉ A} — все элементы универсума, не принадлежащие A.\n\nСвойства операций:\n- Коммутативность: A ∪ B = B ∪ A, A ∩ B = B ∩ A.\n- Ассоциативность: (A ∪ B) ∪ C = A ∪ (B ∪ C), (A ∩ B) ∩ C = A ∩ (B ∩ C).\n- Дистрибутивность: A ∪ (B ∩ C) = (A ∪ B) ∩ (A ∪ C); A ∩ (B ∪ C) = (A ∩ B) ∪ (A ∩ C).\n- Законы де Моргана: (A ∪ B)̅ = A̅ ∩ B̅; (A ∩ B)̅ = A̅ ∪ B̅.\n- Законы идемпотентности: A ∪ A = A, A ∩ A = A.\n- Законы поглощения: A ∪ (A ∩ B) = A, A ∩ (A ∪ B) = A.\n- Свойства с пустым и универсальным множеством: A ∪ ∅ = A, A ∩ ∅ = ∅, A ∪ U = U, A ∩ U = A.\n\nОперации удобно иллюстрировать диаграммами Венна.",
      "keywords": ["объединение", "пересечение", "разность", "симметрическая разность", "дополнение", "де морган", "диаграмма венна"]
    },
    {
      "title": "Бинарные отношения и их свойства",
      "content": "Бинарным отношением между множествами A и B называется любое подмножество R ⊆ A × B. Если (a, b) ∈ R, пишут a R b. Если A = B, говорят об отношении на множестве A.\n\nОсновные свойства отношений на множестве A:\n• Рефлексивность: ∀a ∈ A: a R a.\n• Антирефлексивность: ∀a ∈ A: a R a не выполняется.\n• Симметричность: ∀a, b ∈ A: a R b ⇒ b R a.\n• Антисимметричность: ∀a, b ∈ A: (a R b и b R a) ⇒ a = b.\n• Транзитивность: ∀a, b, c ∈ A: (a R b и b R c) ⇒ a R c.\n\nВажные типы отношений:\n- Отношение эквивалентности (рефлексивно, симметрично, транзитивно) разбивает множество на классы эквивалентности.\n- Отношение порядка (рефлексивно, антисимметрично, транзитивно) — частичный порядок. Если дополнительно для любых a, b выполняется a R b или b R a, то это линейный (полный) порядок.\n- Отношение толерантности (рефлексивно, симметрично) — ослабленная эквивалентность.\n\nПример: отношение «≤» на числах — линейный порядок; отношение «делится на» на натуральных числах — частичный порядок.",
      "keywords": ["бинарное отношение", "рефлексивность", "симметричность", "транзитивность", "эквивалентность", "порядок"]
    },
    {
      "title": "Функции (отображения)",
      "content": "Функцией (отображением) из множества A в множество B называется бинарное отношение f ⊆ A × B, в котором каждому элементу a ∈ A сопоставлен ровно один элемент b ∈ B. Обозначение: f: A → B, f(a) = b. A — область определения, B — область значений.\n\nВиды функций:\n• Инъекция (однозначное отображение): разным элементам A соответствуют разные образы в B (f(a₁) = f(a₂) ⇒ a₁ = a₂).\n• Сюръекция (отображение на): каждый элемент B имеет хотя бы один прообраз (∀b ∈ B ∃a ∈ A: f(a) = b).\n• Биекция (взаимно-однозначное соответствие): одновременно инъекция и сюръекция.\n\nКомпозиция функций (f ∘ g)(x) = f(g(x)). Обратная функция существует только для биекций.\n\nМощность множества связана с существованием биекций: множества равномощны, если между ними можно установить биекцию.",
      "keywords": ["функция", "отображение", "инъекция", "сюръекция", "биекция", "композиция"]
    },
    {
      "title": "Комбинаторика: основные правила",
      "content": "Комбинаторика изучает способы подсчёта числа комбинаций объектов.\n\nПравило суммы: если объект A можно выбрать n способами, а объект B — m способами, причём выборы не пересекаются, то выбрать «либо A, либо B» можно n + m способами.\n\nПравило произведения: если объект A можно выбрать n способами, и после каждого такого выбора объект B можно выбрать m способами, то упорядоченную пару (A, B) можно выбрать n·m способами.\n\nПринцип включения-исключения: для подсчёта объединения пересекающихся множеств: |A ∪ B| = |A| + |B| - |A ∩ B|. Для трёх множеств: |A ∪ B ∪ C| = |A|+|B|+|C| - |A∩B| - |A∩C| - |B∩C| + |A∩B∩C|.",
      "keywords": ["комбинаторика", "правило суммы", "правило произведения", "включения-исключения"]
    },
    {
      "title": "Комбинаторные конфигурации: перестановки, размещения, сочетания",
      "content": "Рассмотрим множество из n различных элементов.\n\n• Перестановки: число способов упорядочить все n элементов. P(n) = n! (n факториал). Пример: 3! = 6.\n\n• Размещения из n по k (k ≤ n) — упорядоченные выборки объёма k. Число размещений: A(n, k) = n! / (n-k)!. Пример: сколько можно составить трёхзначных чисел из цифр 1,2,3,4 без повторений? A(4,3)=24.\n\n• Сочетания из n по k — неупорядоченные выборки (подмножества) объёма k. Число сочетаний: C(n, k) = n! / (k!·(n-k)!). Обозначается также как биномиальный коэффициент ⟨n k⟩. Пример: число способов выбрать 2 книги из 5: C(5,2)=10.\n\nСвойства сочетаний:\n- C(n, k) = C(n, n-k).\n- Рекуррентная формула: C(n, k) = C(n-1, k-1) + C(n-1, k).\n- Бином Ньютона: (a + b)ⁿ = Σ_{k=0}^{n} C(n, k) a^{n-k} b^{k}.\n\nРазмещения с повторениями: A'(n, k) = n^k (выборка с повторениями, порядок важен). Сочетания с повторениями: C'(n, k) = C(n+k-1, k).",
      "keywords": ["перестановки", "размещения", "сочетания", "бином ньютона", "факториал", "биномиальный коэффициент"]
    },
    {
      "title": "Теория графов: основные понятия",
      "content": "Граф G = (V, E) состоит из множества вершин V и множества рёбер E, соединяющих пары вершин. Ребро может быть ориентированным (дуга) или неориентированным. Если ребро соединяет вершину саму с собой, это петля.\n\nСтепень вершины deg(v) — число инцидентных ей рёбер (для неориентированного графа). В ориентированном графе различают полустепень исхода (число выходящих дуг) и полустепень захода.\n\nГраф называется простым, если он не содержит петель и кратных рёбер.\n\nВиды графов:\n- Полный граф K_n: каждая пара вершин соединена ребром.\n- Двудольный граф: вершины можно разбить на две доли так, что рёбра соединяют только вершины из разных долей.\n- Дерево: связный граф без циклов.\n- Ориентированный граф (орграф): все рёбра ориентированы.\n\nПуть — последовательность вершин, где каждая следующая соединена с предыдущей. Цикл — путь, начинающийся и заканчивающийся в одной вершине без повторения рёбер.\n\nГраф связен, если между любыми двумя вершинами существует путь. Компонента связности — максимальный связный подграф.",
      "keywords": ["граф", "вершина", "ребро", "степень", "путь", "цикл", "связность", "дерево"]
    },
    {
      "title": "Специальные типы графов и алгоритмы обхода",
      "content": "• Эйлеров цикл — цикл, проходящий каждое ребро графа ровно один раз. Граф обладает эйлеровым циклом тогда и только тогда, когда он связен и все вершины имеют чётную степень (для неориентированного графа). Эйлеров путь (не цикл) — если ровно две вершины имеют нечётную степень.\n\n• Гамильтонов цикл — цикл, проходящий каждую вершину ровно один раз. Задача поиска гамильтонова цикла NP-полна.\n\nОбходы графа:\n- Поиск в ширину (BFS): обход по уровням, используется для поиска кратчайшего пути в невзвешенном графе.\n- Поиск в глубину (DFS): идёт вглубь, используется для проверки связности, поиска циклов, топологической сортировки.\n\nВзвешенные графы имеют числовые метки на рёбрах. Алгоритм Дейкстры находит кратчайший путь от одной вершины до всех остальных в графе с неотрицательными весами.",
      "keywords": ["эйлеров цикл", "гамильтонов цикл", "bfs", "dfs", "дейкстра", "обход графа"]
    },
    {
      "title": "Деревья и их свойства",
      "content": "Дерево — связный граф без циклов. Основные свойства:\n- В дереве с n вершинами ровно n-1 ребро.\n- Любые две вершины соединены единственным путём.\n- Добавление любого ребра создаёт цикл, удаление любого ребра нарушает связность.\n\nОриентированное дерево — корневое дерево, где рёбра направлены от корня к листьям.\n\nЛес — несвязный граф, компонентами которого являются деревья.\n\nОстовное дерево (стягивающее) — подграф, содержащий все вершины и являющийся деревом. Алгоритмы построения: Прима, Краскала (для минимального остовного дерева во взвешенном графе).\n\nБинарные деревья используются в информатике: каждый узел имеет не более двух потомков. Двоичное дерево поиска позволяет эффективно искать, вставлять и удалять элементы.",
      "keywords": ["дерево", "остовное дерево", "бинарное дерево", "лес", "алгоритм прима", "краскал"]
    },
    {
      "title": "Булева алгебра и логические операции",
      "content": "Булева алгебра — алгебра логики, оперирующая переменными, которые могут принимать два значения: 0 (ложь) и 1 (истина). Основные операции:\n- Конъюнкция (И, AND, ∧): 1 только если оба операнда 1.\n- Дизъюнкция (ИЛИ, OR, ∨): 0 только если оба 0.\n- Отрицание (НЕ, NOT, ¬): инвертирует значение.\n- Импликация (→): a → b эквивалентна ¬a ∨ b.\n- Эквиваленция (↔): a ↔ b истинна, когда a и b равны.\n\nТаблицы истинности задают результат операции для всех комбинаций входов.\n\nЗаконы булевой алгебры (аналогичны законам множеств):\n- Коммутативность: a ∧ b = b ∧ a, a ∨ b = b ∨ a.\n- Ассоциативность: (a ∧ b) ∧ c = a ∧ (b ∧ c), (a ∨ b) ∨ c = a ∨ (b ∨ c).\n- Дистрибутивность: a ∧ (b ∨ c) = (a ∧ b) ∨ (a ∧ c); a ∨ (b ∧ c) = (a ∨ b) ∧ (a ∨ c).\n- Законы де Моргана: ¬(a ∧ b) = ¬a ∨ ¬b; ¬(a ∨ b) = ¬a ∧ ¬b.\n- Законы поглощения: a ∧ (a ∨ b) = a; a ∨ (a ∧ b) = a.\n- Законы с константами: a ∧ 0 = 0, a ∧ 1 = a, a ∨ 0 = a, a ∨ 1 = 1.\n- Закон двойного отрицания: ¬(¬a) = a.\n\nЛюбая булева функция может быть представлена в виде СДНФ (совершенная дизъюнктивная нормальная форма) или СКНФ.",
      "keywords": ["булева алгебра", "логика", "конъюнкция", "дизъюнкция", "отрицание", "импликация", "эквиваленция", "таблица истинности", "сднф", "скнф"]
    },
    {
      "title": "Минимизация булевых функций. Карты Карно.",
      "content": "Минимизация булевых функций позволяет получить более простую логическую схему. Один из наглядных методов — карты Карно (Karnaugh maps).\n\nКарта Карно для n переменных представляет собой таблицу из 2ⁿ клеток, каждая соответствует одному набору переменных. Клетки расположены так, что соседние отличаются значением только одной переменной (код Грея).\n\nПравила минимизации:\n- Объединяют прямоугольные блоки из 1, 2, 4, 8,... соседних клеток (включая циклическое соседство).\n- Чем больше блок, тем проще результирующий терм.\n- Каждый блок даёт произведение переменных (или их отрицаний), которые не меняются в этом блоке.\n- Минимальная ДНФ получается как дизъюнкция минимальных покрытий всех единиц.\n\nПример: для функции двух переменных карта 2×2; для трёх — 2×4; для четырёх — 4×4. Карты Карно удобны для функций до 4-5 переменных. Для большего числа используют методы Куайна-Мак-Класки.",
      "keywords": ["минимизация", "карта карно", "сднф", "скнф", "метод куайна"]
    },
    {
      "title": "Математическая логика: высказывания и предикаты",
      "content": "Высказывание — утверждение, которое может быть истинным или ложным. Логика высказываний оперирует простыми высказываниями и связками (¬, ∧, ∨, →, ↔).\n\nПредикат — функция, зависящая от переменных и превращающаяся в высказывание при подстановке конкретных значений. Например, P(x) = «x > 0». Область истинности предиката — множество значений, при которых он истинен.\n\nКванторы:\n- Квантор всеобщности ∀x P(x) — «для всех x истинно P(x)».\n- Квантор существования ∃x P(x) — «существует x, для которого истинно P(x)».\n\nФормулы логики предикатов строятся из предикатов, кванторов и связок. Интерпретация задаёт предметную область и значения предикатов.\n\nОбщезначимая формула (тавтология) истинна при любой интерпретации. Противоречие (невыполнима) ложна всегда.\n\nПравила отрицания кванторов: ¬∀x P(x) ≡ ∃x ¬P(x); ¬∃x P(x) ≡ ∀x ¬P(x).",
      "keywords": ["высказывание", "предикат", "квантор", "∀", "∃", "тавтология", "логика"]
    },
    {
      "title": "Рекуррентные соотношения и методы их решения",
      "content": "Рекуррентное соотношение задаёт последовательность, выражая каждый следующий член через предыдущие. Например, числа Фибоначчи: F₀ = 0, F₁ = 1, Fₙ = Fₙ₋₁ + Fₙ₋₂ для n ≥ 2.\n\nЛинейные однородные рекуррентные соотношения с постоянными коэффициентами имеют вид: aₙ = c₁·aₙ₋₁ + c₂·aₙ₋₂ + ... + cₖ·aₙ₋ₖ.\n\nМетод решения: ищем решение в виде aₙ = rⁿ. Подставляем, получаем характеристическое уравнение rᵏ = c₁·rᵏ⁻¹ + ... + cₖ. Корни r₁,...,rₖ дают общее решение aₙ = α₁·r₁ⁿ + ... + αₖ·rₖⁿ (если корни простые). Если есть кратные корни, добавляются множители nᵐ.\n\nДля неоднородных уравнений сначала находят частное решение, зависящее от вида неоднородности, затем складывают с общим решением однородного.\n\nПример: решить Fₙ = Fₙ₋₁ + Fₙ₋₂. Характеристическое уравнение r² - r - 1 = 0 → корни (1±√5)/2 (золотое сечение).",
      "keywords": ["рекуррентность", "числа фибоначчи", "характеристическое уравнение", "линейные рекуррентные соотношения"]
    },
    {
      "title": "Принцип математической индукции",
      "content": "Математическая индукция — метод доказательства утверждений, зависящих от натурального n.\n\nПростая индукция:\n1. База индукции: доказываем утверждение для n = 1 (или другого начального значения).\n2. Индукционный переход: предполагаем, что утверждение верно для n = k (индукционное предположение), и доказываем для n = k+1.\n\nПример: доказать, что 1 + 2 + ... + n = n(n+1)/2.\nБаза n=1: 1 = 1·2/2 верно.\nПереход: пусть для n верно, тогда для n+1: сумма = n(n+1)/2 + (n+1) = (n+1)(n/2+1) = (n+1)(n+2)/2.\n\nСильная индукция: в предположении используем, что утверждение верно для всех меньших значений (например, от 1 до k).\n\nИндукция широко применяется в комбинаторике, теории чисел, анализе алгоритмов.",
      "keywords": ["индукция", "математическая индукция", "доказательство", "база", "переход"]
    },
    {
      "title": "Основы теории кодирования",
      "content": "Кодирование — процесс преобразования информации в форму, удобную для передачи или хранения. Код — множество кодовых слов (последовательностей символов).\n\nОсновные понятия:\n- Алфавит — конечное множество символов (например, {0,1} для двоичного кода).\n- Длина кода — число символов в кодовом слове.\n- Однозначность декодирования: код должен допускать единственное разбиение последовательности на кодовые слова. Префиксные коды (ни одно кодовое слово не является началом другого) гарантируют однозначность.\n\nНеравенство Крафта: для существования префиксного кода с длинами l₁,...,lₘ в алфавите размера r необходимо и достаточно, чтобы Σ r^{-lᵢ} ≤ 1.\n\nОптимальное кодирование (метод Хаффмана) строит префиксный код с минимальной средней длиной для заданных вероятностей символов.\n\nКоды с обнаружением и исправлением ошибок добавляют избыточность. Расстояние Хэмминга между двумя словами — число позиций, в которых они различаются. Код может обнаружить до d-1 ошибок и исправить до ⌊(d-1)/2⌋ ошибок, где d — минимальное расстояние Хэмминга между кодовыми словами.\n\nПримеры: код Хэмминга (исправляет одну ошибку), циклические коды, код Рида-Соломона.",
      "keywords": ["кодирование", "префиксный код", "неравенство крафта", "хаффман", "расстояние хэмминга", "код с исправлением ошибок"]
    }
  ]
}