{
  "topics": [
    {
      "title": "Древняя Русь (IX–XIII вв.)",
      "content": "Образование Древнерусского государства с центром в Киеве (IX в.). Князья: Рюрик, Олег, Игорь, Ольга, Святослав, Владимир Святой. Крещение Руси в 988 году. Ярослав Мудрый, «Русская правда». Период феодальной раздробленности (XII–XIII вв.). Борьба с половцами. Нашествие монголо-татар в 1237–1240 гг., установление ига.",
      "keywords": ["русь", "рюрик", "крещение", "раздробленность", "монголы"]
    },
    {
      "title": "Московское княжество и образование единого государства (XIV–XVI вв.)",
      "content": "Возвышение Москвы. Иван Калита, Дмитрий Донской — Куликовская битва 1380 г. Иван III — присоединение Новгорода, свержение ордынского ига (1480), принятие Судебника 1497 г. Василий III. Иван IV Грозный: венчание на царство (1547), реформы Избранной рады, опричнина, присоединение Казани и Астрахани, Ливонская война. Смутное время (1598–1613): Борис Годунов, Лжедмитрий, восстание Болотникова, освобождение Москвы Мининым и Пожарским.",
      "keywords": ["москва", "иван грозный", "опричнина", "смута"]
    },
    {
      "title": "Россия в XVII веке",
      "content": "Первые Романовы: Михаил Фёдорович, Алексей Михайлович. Соборное уложение 1649 г. (закрепощение крестьян). Церковный раскол (Никон и Аввакум). Восстания: Соляной и Медный бунты, восстание Степана Разина. Воссоединение Украины с Россией (1654). Присоединение Сибири.",
      "keywords": ["романовы", "соборное уложение", "раскол", "разин"]
    },
    {
      "title": "Российская империя в XVIII веке",
      "content": "Пётр I: реформы, Северная война (1700–1721), основание Петербурга, провозглашение империи (1721). Эпоха дворцовых переворотов. Екатерина II: просвещённый абсолютизм, крестьянская война Пугачёва, присоединение Крыма, разделы Польши. Павел I. Русская культура XVIII в.: Ломоносов, Радищев, Фонвизин.",
      "keywords": ["петр i", "екатерина ii", "империя", "перевороты"]
    },
    {
      "title": "Россия в первой половине XIX века",
      "content": "Александр I: реформы, Отечественная война 1812 г., заграничные походы. Декабристы (1825). Николай I: ужесточение режима, кодификация законов, промышленная революция, Кавказская война, Крымская война (1853–1856). Развитие культуры: Пушкин, Лермонтов, Гоголь.",
      "keywords": ["александр i", "1812", "декабристы", "николай i"]
    },
    {
      "title": "Россия во второй половине XIX века",
      "content": "Александр II: Великие реформы (отмена крепостного права 1861, земская, судебная, военная). Народничество. Александр III: контрреформы. Развитие капитализма. Внешняя политика: продажа Аляски, русско-турецкая война 1877–1878. Культура: Толстой, Достоевский, Чехов, передвижники.",
      "keywords": ["александр ii", "реформы", "народничество", "александр iii"]
    },
    {
      "title": "Россия в начале XX века",
      "content": "Николай II. Русско-японская война 1904–1905. Революция 1905–1907, Манифест 17 октября, Столыпинская аграрная реформа. Первая мировая война. Февральская революция 1917, отречение Николая II. Октябрьская революция, приход большевиков к власти. Гражданская война (1918–1922).",
      "keywords": ["николай ii", "революция", "столыпин", "гражданская война"]
    },
    {
      "title": "Советский Союз (1922–1991)",
      "content": "НЭП. Образование СССР. Индустриализация и коллективизация. Культ личности Сталина, репрессии. Великая Отечественная война (1941–1945). Послевоенное восстановление. Хрущёв: оттепель, освоение целины, Карибский кризис. Брежнев: застой. Горбачёв: перестройка, гласность, распад СССР.",
      "keywords": ["ссср", "сталин", "война", "хрущёв", "брежнев", "горбачёв"]
    },
    {
      "title": "Современная Россия (с 1991 г.)",
      "content": "Принятие Конституции 1993 г. Президенты: Ельцин, Путин, Медведев. Экономические реформы, переход к рынку. Чеченские войны. Социально-экономическое развитие в 2000-е годы. Внешняя политика.",
      "keywords": ["ельцин", "путин", "конституция"]
    }
  ]
}