{
  "topics": [
    {
      "title": "Восточные славяне и образование Древнерусского государства",
      "content": "Восточные славяне: происхождение, расселение, занятия (земледелие, скотоводство, промыслы), общественный строй (родовая община, вече), верования (язычество). Предпосылки образования государства: развитие хозяйства, появление городов (Киев, Новгород), внешняя опасность (варяги, хазары). Призвание варягов (862 г.) – легенда о Рюрике. Норманнская и антинорманнская теории. Объединение Новгорода и Киева князем Олегом (882 г.) – начало Древнерусского государства.",
      "keywords": ["славяне", "Рюрик", "Олег", "Киев", "Новгород", "государство"]
    },
    {
      "title": "Киевская Русь в X – начале XII вв.",
      "content": "Правление первых князей: Олег (882–912) – объединение восточнославянских племен, походы на Византию. Игорь (912–945) – восстание древлян. Ольга (945–964) – реформа налогообложения (уроки, погосты), принятие христианства. Святослав (964–972) – военные походы, разгром Хазарского каганата. Владимир I Святой (980–1015) – языческая реформа, крещение Руси (988) – значение для культуры и международного положения. Ярослав Мудрый (1019–1054) – расцвет Киевской Руси: «Русская правда» (первый письменный закон), династические браки, строительство Софийского собора.",
      "keywords": ["Ольга", "Святослав", "Владимир", "крещение", "Ярослав Мудрый", "Русская правда"]
    },
    {
      "title": "Феодальная раздробленность на Руси (XII – XIII вв.)",
      "content": "Причины раздробленности: рост вотчинного землевладения, усиление местных князей, упадок торгового пути «из варяг в греки», отсутствие чёткого порядка престолонаследия. Любечский съезд (1097) – «каждый да держит отчину свою». Крупные княжества: Владимиро-Суздальское, Галицко-Волынское, Новгородская республика. Андрей Боголюбский, Всеволод Большое Гнездо. Последствия: ослабление обороноспособности, культурное разнообразие.",
      "keywords": ["раздробленность", "Любечский съезд", "Владимиро-Суздальское", "Новгород"]
    },
    {
      "title": "Монгольское нашествие и установление ига (1237–1240)",
      "content": "Чингисхан, образование Монгольской империи. Битва на Калке (1223). Нашествие Батыя: разорение Рязани, Владимира, Киева (1240). Причины поражения русских княжеств. Установление ордынского ига: система баскачества, ярлыки на княжение, дань (выход). Последствия: экономический упадок, изоляция от Европы, изменение политической системы, влияние на культуру. Александр Невский: борьба с немецкими и шведскими рыцарями (Невская битва, Ледовое побоище) и политика сотрудничества с Ордой.",
      "keywords": ["Батый", "иго", "Золотая Орда", "Александр Невский", "Калка"]
    },
    {
      "title": "Возвышение Москвы и объединение русских земель (XIV – XV вв.)",
      "content": "Причины возвышения Москвы: выгодное географическое положение, поддержка церкви, гибкая политика московских князей. Иван Калита (1325–1340) – получение ярлыка на великое княжение, подавление тверского восстания. Дмитрий Донской (1359–1389) – Куликовская битва (1380), первая победа над ордынцами, значение для национального самосознания. Набег Тохтамыша (1382). Василий I и Василий II (Тёмный) – феодальная война второй четверти XV в. Иван III (1462–1505): присоединение Новгорода (1478), Твери (1485), стояние на реке Угре (1480) – свержение ордынского ига. Принятие Судебника 1497 г. – начало оформления крепостного права (Юрьев день).",
      "keywords": ["Москва", "Калита", "Донской", "Куликовская битва", "Иван III", "Угра"]
    },
    {
      "title": "Россия в XVI веке. Иван Грозный.",
      "content": "Василий III (1505–1533) – завершение объединения, Смоленск. Иван IV Грозный (1533–1584): венчание на царство (1547), реформы Избранной рады (1549–1560) – новый Судебник 1550, созыв Земских соборов, военная реформа, создание стрелецкого войска. Внешняя политика: присоединение Казани (1552) и Астрахани (1556), покорение Сибири (поход Ермака), Ливонская война (1558–1583) за выход к Балтике (поражение). Опричнина (1565–1572): разделение страны на земщину и опричнину, террор, разгром Новгорода, последствия – хозяйственный кризис, ослабление страны.",
      "keywords": ["Иван Грозный", "Казань", "Ливонская война", "опричнина", "Ермак"]
    },
    {
      "title": "Смутное время (1598–1613)",
      "content": "Причины: династический кризис (пресечение династии Рюриковичей после смерти Фёдора Иоанновича), социально-экономический кризис (голод 1601–1603), недовольство различных слоёв. Борис Годунов (1598–1605). Появление Лжедмитрия I (1605–1606) при поддержке Польши. Василий Шуйский (1606–1610) – восстание Болотникова (1606–1607). Лжедмитрий II («Тушинский вор»). Семибоярщина (1610), приглашение польского королевича Владислава. Первое и Второе ополчения: Минин и Пожарский, освобождение Москвы (1612). Земский собор 1613 – избрание Михаила Романова. Последствия Смуты.",
      "keywords": ["Смута", "Годунов", "Лжедмитрий", "Минин", "Пожарский", "Романовы"]
    },
    {
      "title": "Россия при первых Романовых (XVII в.)",
      "content": "Михаил Фёдорович (1613–1645) – восстановление хозяйства, укрепление самодержавия, роль Земских соборов. Алексей Михайлович (1645–1676): Соборное уложение 1649 г. – окончательное закрепощение крестьян (бессрочный сыск беглых), оформление сословной структуры. Церковный раскол: реформы патриарха Никона (исправление богослужебных книг, обрядов), возникновение старообрядчества (протопоп Аввакум). Восстания: Соляной бунт (1648), Медный бунт (1662), восстание Степана Разина (1670–1671). Внешняя политика: присоединение Левобережной Украины (Переяславская рада, 1654), война с Польшей, освоение Сибири.",
      "keywords": ["Романовы", "Соборное уложение", "раскол", "Никон", "Разин", "Украина"]
    },
    {
      "title": "Эпоха Петра I: реформы и модернизация (1682–1725)",
      "content": "Начало правления: двоецарствие с Иваном V, регентство Софьи, борьба за власть. Азовские походы (1695–1696). Великое посольство (1697–1698). Северная война (1700–1721): цели, основные сражения (Полтава, 1709; Гангут, 1714), Ништадтский мир, выход к Балтике. Реформы: государственного управления (Сенат, коллегии, губернская реформа), церковная (упразднение патриаршества, Синод), военная (рекрутские наборы, создание регулярной армии и флота), экономическая (развитие мануфактур, протекционизм), социальная (Табель о рангах, указ о единонаследии), культурная (открытие школ, введение гражданского шрифта, создание Академии наук, строительство Петербурга). Провозглашение империи (1721). Оценки личности и деятельности Петра I.",
      "keywords": ["Петр I", "Северная война", "Полтава", "реформы", "империя", "Сенат"]
    },
    {
      "title": "Эпоха дворцовых переворотов (1725–1762)",
      "content": "Причины: отсутствие чёткого порядка престолонаследия, роль гвардии. Екатерина I (1725–1727), Верховный тайный совет. Пётр II (1727–1730). Анна Иоанновна (1730–1740): кондиции и их отмена, бироновщина. Иван VI (1740–1741). Елизавета Петровна (1741–1761): возвращение к петровским традициям, открытие Московского университета (1755), Семилетняя война (1756–1763). Пётр III (1761–1762): Манифест о вольности дворянства, прекращение войны с Пруссией. Итоги эпохи: усиление роли дворянства, стабилизация внутриполитической жизни.",
      "keywords": ["дворцовые перевороты", "гвардия", "Анна Иоанновна", "Елизавета", "Пётр III"]
    },
    {
      "title": "Правление Екатерины II. Политика «просвещённого абсолютизма»",
      "content": "Екатерина II (1762–1796): идеи просвещения, переписка с Вольтером, Уложенная комиссия (1767–1768). Губернская реформа (1775) – укрепление местной власти. Жалованная грамота дворянству (1785) – подтверждение привилегий. Жалованная грамота городам. Крестьянская война под предводительством Емельяна Пугачёва (1773–1775). Внешняя политика: русско-турецкие войны (1768–1774, 1787–1791) – присоединение Крыма (1783), выход к Чёрному морю; разделы Польши (1772, 1793, 1795); борьба с Французской революцией. Развитие культуры и науки (Эрмитаж, Академия художеств, Державин, Фонвизин).",
      "keywords": ["Екатерина II", "просвещённый абсолютизм", "Пугачёв", "разделы Польши", "Крым"]
    },
    {
      "title": "Павел I (1796–1801): противоречивый император",
      "content": "Личность Павла, его идеи. Внутренняя политика: ограничение дворянских привилегий (отмена Жалованной грамоты, телесные наказания), указ о престолонаследии (переход по мужской линии), военная реформа (прусские порядки). Внешняя политика: участие в антифранцузских коалициях, переход к союзу с Наполеоном. Заговор и убийство Павла I. Противоречивость оценок.",
      "keywords": ["Павел I", "престолонаследие", "заговор", "Мальтийский орден"]
    },
    {
      "title": "Россия в первой четверти XIX века. Александр I и Отечественная война 1812 г.",
      "content": "Александр I (1801–1825): либеральные начинания (Негласный комитет, реформы Сперанского, учреждение министерств). Внешняя политика: участие в антинаполеоновских коалициях, Тильзитский мир (1807), война со Швецией (присоединение Финляндии). Отечественная война 1812: причины, планы сторон, ход войны (Смоленское сражение, Бородино, совет в Филях, Тарутинский манёвр, партизанское движение, гибель «Великой армии»). Заграничные походы русской армии (1813–1814), Венский конгресс, Священный союз. Внутренняя политика после войны: аракчеевщина, военные поселения. Противоречивость личности Александра.",
      "keywords": ["Александр I", "1812", "Бородино", "Кутузов", "Наполеон", "Священный союз"]
    },
    {
      "title": "Движение декабристов (1816–1825)",
      "content": "Причины возникновения тайных обществ: влияние заграничных походов, идеи Просвещения, реформаторские надежды. Первые организации: Союз спасения, Союз благоденствия. Южное и Северное общества: программы («Русская правда» Пестеля и «Конституция» Муравьёва). Восстание 14 декабря 1825 г. на Сенатской площади, восстание Черниговского полка на юге. Причины поражения, следствие и суд над декабристами. Значение движения.",
      "keywords": ["декабристы", "Пестель", "Муравьёв", "восстание", "Сенатская площадь"]
    },
    {
      "title": "Николай I (1825–1855): апогей самодержавия",
      "content": "Личность Николая I. Укрепление самодержавия: создание III отделения Собственной Е.И.В. канцелярии (политическая полиция), цензурный устав, кодификация законов (Свод законов Российской империи под руководством Сперанского). Финансовая реформа Канкрина. Крестьянский вопрос: реформа государственных крестьян Киселёва, указ об обязанных крестьянах. Общественная мысль: теория официальной народности (Уваров), западники и славянофилы. Внешняя политика: Кавказская война (1817–1864), подавление польского восстания (1830–1831), русско-иранская и русско-турецкая войны, Крымская война (1853–1856) – причины, ход, героическая оборона Севастополя, Парижский мирный договор (поражение).",
      "keywords": ["Николай I", "III отделение", "западники", "славянофилы", "Крымская война", "Севастополь"]
    },
    {
      "title": "Великие реформы Александра II (1855–1881)",
      "content": "Предпосылки реформ: поражение в Крымской войне, социально-экономическое отставание. Александр II. Отмена крепостного права (1861): Манифест, условия освобождения, отрезки, временнообязанные, выкупные платежи, значение. Земская (1864) и городская (1870) реформы – создание органов местного самоуправления. Судебная реформа (1864) – введение суда присяжных, независимость суда, гласность. Военная реформа (1860–1870-е) – введение всесословной воинской повинности, перевооружение. Реформы в области образования и печати. Значение реформ для модернизации страны.",
      "keywords": ["Александр II", "отмена крепостного права", "1861", "земства", "судебная реформа"]
    },
    {
      "title": "Общественное движение в пореформенной России",
      "content": "Консервативное направление (М.Н. Катков, К.П. Победоносцев). Либералы (Б.Н. Чичерин, К.Д. Кавелин) – земское движение. Народничество: идеология (Герцен, Чернышевский), три течения (бунтарское – Бакунин, пропагандистское – Лавров, заговорщическое – Ткачёв). «Хождение в народ» (1870-е). Организация «Земля и воля», её раскол на «Чёрный передел» (Плеханов) и «Народную волю» (Желябов, Перовская). Убийство Александра II 1 марта 1881 г.",
      "keywords": ["народничество", "Герцен", "Бакунин", "Народная воля", "1 марта"]
    },
    {
      "title": "Контрреформы Александра III (1881–1894)",
      "content": "Александр III: личность, политические взгляды. Манифест о незыблемости самодержавия (1881). Меры по укреплению самодержавия: усиление административного контроля, ограничение земского и городского самоуправления (земские начальники, контрреформы 1890-х), ужесточение цензуры, политика русификации. Социально-экономическое развитие: завершение промышленного переворота, рост фабрик, рабочий вопрос (фабричное законодательство). Финансовая стабилизация (реформы Бунге, Вышнеградского). Внешняя политика: сближение с Францией (русско-французский союз), миролюбие на Балканах. Итоги царствования.",
      "keywords": ["Александр III", "контрреформы", "земские начальники", "союз с Францией"]
    },
    {
      "title": "Россия на рубеже XIX–XX веков. Экономическое развитие и социальные противоречия",
      "content": "Особенности российской модернизации: высокие темпы промышленного роста, концентрация производства, роль государства, иностранный капитал. Реформы С.Ю. Витте: денежная реформа (1897), введение винной монополии, строительство Транссибирской магистрали. Противоречия: аграрный вопрос (малоземелье крестьян, сохранение общины), рабочий вопрос (тяжёлые условия труда, рост стачек), национальные движения. Возникновение политических партий: РСДРП (большевики и меньшевики), эсеры, кадеты, октябристы. Русско-японская война (1904–1905): причины, ход (Порт-Артур, Цусима, Мукден), Портсмутский мир, поражение и его влияние.",
      "keywords": ["Витте", "индустриализация", "Транссиб", "русско-японская война", "партии"]
    },
    {
      "title": "Революция 1905–1907 гг.",
      "content": "Причины: нерешённость аграрного, рабочего, национального вопросов, поражение в войне, «Кровавое воскресенье» (9 января 1905). Нарастание революционных выступлений: стачки, крестьянские восстания, восстание на броненосце «Потёмкин». Манифест 17 октября 1905 г. (дарование свобод, создание законодательной Государственной думы). Формирование партий. Декабрьское вооружённое восстание в Москве. Деятельность I и II Государственных дум. Третьеиюньский переворот (1907) – изменение избирательного закона, окончание революции. Итоги: создание парламента, легализация партий, некоторое улучшение положения рабочих, но основные противоречия не решены.",
      "keywords": ["1905", "кровавое воскресенье", "Манифест 17 октября", "Дума", "потёмкин"]
    },
    {
      "title": "Столыпинская аграрная реформа",
      "content": "П.А. Столыпин: личность, программа реформ. Цели аграрной реформы: разрушение общины, создание слоя крестьян-собственников (фермеров), повышение сельскохозяйственного производства. Указ от 9 ноября 1906 г., закон 1910 г. Право выхода из общины, закрепление земли в собственность, образование отрубов и хуторов, переселенческая политика (переселение крестьян в Сибирь и на Дальний Восток). Итоги и незавершённость реформы, её противоречивость.",
      "keywords": ["Столыпин", "аграрная реформа", "община", "отруб", "хутор", "переселение"]
    },
    {
      "title": "Россия в Первой мировой войне (1914–1918)",
      "content": "Причины и повод к войне. Участие России: планы, основные фронты (Восточный фронт), крупные операции (Восточно-Прусская, Галицийская битва, Брусиловский прорыв, 1916). Влияние войны на экономику и общество: кризис снабжения, рост цен, недовольство. Падение авторитета власти, «распутинщина», министерская чехарда. Нарастание революционного движения.",
      "keywords": ["Первая мировая", "Брусиловский прорыв", "восточный фронт", "кризис"]
    },
    {
      "title": "Февральская революция 1917 г.",
      "content": "Причины: тяготы войны, недовольство властью, продовольственный кризис. Ход событий в Петрограде: 23 февраля (8 марта) – начало забастовок, переход войск на сторону восставших. Отречение Николая II (2 марта). Образование Петроградского совета и Временного комитета Госдумы. Двоевластие. Состав и политика Временного правительства (кадеты, октябристы, эсеры, меньшевики). Основные проблемы: война, аграрный вопрос, национальный вопрос. Кризисы власти (апрельский, июньский, июльский). Выступление генерала Корнилова.",
      "keywords": ["Февральская революция", "Николай II", "Временное правительство", "двоевластие"]
    },
    {
      "title": "Октябрьская революция 1917 г.",
      "content": "Курс большевиков на вооружённое восстание. Ленин, Троцкий. Подготовка и проведение восстания в Петрограде (25 октября по старому стилю). Захват Зимнего дворца, арест Временного правительства. II Всероссийский съезд Советов: декреты о мире и о земле, образование Совета народных комиссаров (СНК) во главе с Лениным. Установление советской власти на местах. Причины победы большевиков.",
      "keywords": ["Октябрьская революция", "Ленин", "СНК", "декрет о мире", "декрет о земле"]
    },
    {
      "title": "Гражданская война и интервенция в России (1918–1922)",
      "content": "Причины и основные противоборствующие силы: красные (большевики) и белые (офицерство, казачество, часть интеллигенции). Начало войны: мятеж Чехословацкого корпуса, создание белых правительств (Колчак, Деникин, Юденич, Врангель). Красная армия (Троцкий), политика «военного коммунизма» (продразвёрстка, национализация, всеобщая трудовая повинность). Крестьянские восстания (антоновщина, махновщина). Интервенция стран Антанты. Основные этапы и сражения. Окончание войны: разгром Врангеля в Крыму (1920), установление советской власти в Закавказье, Средней Азии, на Дальнем Востоке. Итоги и последствия Гражданской войны: огромные людские потери, разруха, утверждение однопартийной системы.",
      "keywords": ["Гражданская война", "Красная армия", "белые", "Колчак", "Деникин", "военный коммунизм"]
    },
    {
      "title": "Новая экономическая политика (НЭП) 1921–1928",
      "content": "Причины перехода к НЭПу: экономический и политический кризис, крестьянские восстания, Кронштадтский мятеж. Замена продразвёрстки продналогом, разрешение свободной торговли, аренда земли, мелкая частная собственность, денационализация мелких предприятий, денежная реформа (червонец). Социальные и культурные изменения. Противоречия НЭПа: кризисы сбыта, рост безработицы, «ножницы цен». Свёртывание НЭПа в конце 1920-х гг.",
      "keywords": ["НЭП", "продналог", "червонец", "кризис", "Кронштадт"]
    },
    {
      "title": "Образование СССР (1922)",
      "content": "Предпосылки объединения советских республик. Проекты объединения: автономизация (Сталин) и федерация (Ленин). Принятие Декларации и Договора об образовании СССР. Первая Конституция СССР (1924). Национально-государственное строительство.",
      "keywords": ["СССР", "автономизация", "федерация", "Конституция 1924"]
    },
    {
      "title": "Индустриализация и коллективизация в СССР",
      "content": "Курс на индустриализацию (конец 1920-х): цели – преодоление технико-экономической отсталости, создание мощной оборонной промышленности. Первые пятилетки (1928–1932, 1933–1937). Энтузиазм и принудительный труд. Итоги: превращение СССР в индустриальную державу, но с перекосом в сторону тяжёлой промышленности. Коллективизация сельского хозяйства: цели – обеспечение города продовольствием, изъятие средств для индустриализации. Массовое создание колхозов, раскулачивание, голод 1932–1933 гг. Последствия коллективизации.",
      "keywords": ["индустриализация", "пятилетка", "коллективизация", "колхоз", "раскулачивание"]
    },
    {
      "title": "Политическая система СССР в 1930-е гг. Массовые репрессии",
      "content": "Укрепление режима личной власти Сталина. Конституция 1936 г. («сталинская конституция») – провозглашение победы социализма. Репрессии: процессы над «врагами народа» (1928–1930-е), Большой террор 1937–1938 гг. (пик). Система ГУЛАГа. Последствия репрессий для общества и армии. Культ личности Сталина.",
      "keywords": ["Сталин", "Конституция 1936", "репрессии", "ГУЛАГ", "Большой террор"]
    },
    {
      "title": "Внешняя политика СССР в 1920–1930-е гг.",
      "content": "Прорыв дипломатической блокады (Генуэзская конференция, Рапалльский договор с Германией, 1922). Политика «умиротворения» агрессоров в Европе. Вступление СССР в Лигу Наций (1934). Попытки создания системы коллективной безопасности. Пакт Молотова–Риббентропа (1939) и секретные протоколы. Советско-финляндская война (1939–1940). Присоединение Западной Украины, Западной Белоруссии, Прибалтики, Бессарабии.",
      "keywords": ["Рапалло", "Лига Наций", "пакт Молотова-Риббентропа", "финская война"]
    },
    {
      "title": "Великая Отечественная война (1941–1945): начальный период",
      "content": "План «Барбаросса», нападение Германии 22 июня 1941. Причины неудач Красной армии в начале войны. Организация отпора: создание Ставки Верховного Главнокомандования, Государственного комитета обороны. Смоленское сражение, оборона Киева, Одессы, Севастополя. Битва за Москву (30 сентября 1941 – 20 апреля 1942) – разгром немцев под Москвой, крах плана «блицкриг».",
      "keywords": ["Великая Отечественная война", "1941", "Барбаросса", "Москва", "блицкриг"]
    },
    {
      "title": "Коренной перелом в ходе войны (1942–1943)",
      "content": "Сталинградская битва (17 июля 1942 – 2 февраля 1943) – окружение и разгром армии Паулюса, начало коренного перелома. Битва на Курской дуге (5 июля – 23 августа 1943) – крупнейшее танковое сражение под Прохоровкой, переход стратегической инициативы к Красной армии. Битва за Днепр (август–декабрь 1943) – освобождение Левобережной Украины, форсирование Днепра.",
      "keywords": ["Сталинград", "Курская дуга", "Прохоровка", "Днепр", "коренной перелом"]
    },
    {
      "title": "Завершающий этап войны (1944–1945)",
      "content": "Десять сталинских ударов (1944): снятие блокады Ленинграда, освобождение Правобережной Украины, Крыма, Белоруссии (операция «Багратион»), Прибалтики, выход на государственную границу. Открытие второго фронта (июнь 1944). Освобождение стран Восточной Европы. Висло-Одерская операция (январь–февраль 1945). Берлинская операция (апрель–май 1945), взятие Берлина, водружение знамени Победы над рейхстагом. Капитуляция Германии 8–9 мая 1945. Потсдамская конференция. Итоги и уроки войны.",
      "keywords": ["1944", "Багратион", "Берлин", "Победа", "Потсдам"]
    },
    {
      "title": "СССР в послевоенные годы (1945–1953)",
      "content": "Восстановление народного хозяйства: масштабы разрушений, источники восстановления (репарации, труд заключённых, перекачка средств из деревни). Четвёртая пятилетка (1946–1950). Отмена карточек (1947), денежная реформа. Идеологические кампании (борьба с космополитизмом, «ждановщина»). «Ленинградское дело», «дело врачей». Атомный проект – создание атомной бомбы (1949). Начало холодной войны: речь Черчилля в Фултоне, создание НАТО, советский атомный щит.",
      "keywords": ["послевоенное восстановление", "пятилетка", "атомная бомба", "холодная война"]
    },
    {
      "title": "Оттепель: правление Н.С. Хрущёва (1953–1964)",
      "content": "Борьба за власть после смерти Сталина. Арест Берии. XX съезд КПСС (1956) – доклад о культе личности Сталина, начало десталинизации. Реабилитация жертв репрессий. Экономические реформы: освоение целины, создание совнархозов, жилищное строительство (хрущёвки). Социальная политика: повышение зарплат, пенсионная реформа. Достижения в науке и технике: запуск первого спутника (1957), полёт Гагарина (1961). Внешняя политика: Карибский кризис (1962), берлинский кризис, мирное сосуществование. Отставка Хрущёва (1964).",
      "keywords": ["Хрущёв", "XX съезд", "оттепель", "целина", "Гагарин", "Карибский кризис"]
    },
    {
      "title": "Эпоха застоя: Л.И. Брежнев (1964–1982)",
      "content": "Приход к власти Брежнева. Экономическая реформа 1965 г. (Косыгинская реформа) – усиление хозрасчёта, её свёртывание. Нарастание застойных явлений: падение темпов роста, топливно-сырьевая зависимость, дефицит товаров. Теневая экономика. Конституция 1977 г. – концепция «развитого социализма». Внешняя политика: политика разрядки (договоры ОСВ-1, ОСВ-2), Хельсинкские соглашения (1975), ввод войск в Афганистан (1979) – конец разрядки. Диссидентское движение (Сахаров, Солженицын).",
      "keywords": ["Брежнев", "застой", "Косыгин", "Конституция 1977", "Афганистан", "диссиденты"]
    },
    {
      "title": "Перестройка: М.С. Горбачёв (1985–1991)",
      "content": "Предпосылки перестройки: нарастание кризисных явлений в экономике и обществе. Курс на ускорение социально-экономического развития (1985). Антиалкогольная кампания. Политика гласности – ослабление цензуры, публикация ранее запрещённых произведений. Экономические реформы: Закон о государственном предприятии (1987), разрешение кооперативов, переход к рыночным отношениям – неудачи. Политическая реформа: введение поста Президента СССР, Съезд народных депутатов. Новое мышление во внешней политике: вывод войск из Афганистана, объединение Германии, окончание холодной войны. Рост национальных движений, парад суверенитетов. Августовский путч (1991). Распад СССР (декабрь 1991).",
      "keywords": ["Горбачёв", "перестройка", "гласность", "ускорение", "распад СССР", "Беловежские соглашения"]
    },
    {
      "title": "Российская Федерация в 1990-е годы",
      "content": "Становление новой российской государственности: президент Б.Н. Ельцин. Экономические реформы: шоковая терапия, либерализация цен, приватизация, появление класса собственников, спад производства, инфляция. Конституционный кризис 1993 г. – противостояние Верховного Совета и президента, принятие новой Конституции 12 декабря 1993 г. (президентская республика). Чеченские войны (1994–1996, 1999–2009). Дефолт 1998 г., его последствия. Внешняя политика: поиск своего места в мире, отношения с Западом, СНГ.",
      "keywords": ["Ельцин", "1993", "Конституция", "приватизация", "дефолт", "Чечня"]
    },
    {
      "title": "Современная Россия: президентство В.В. Путина и Д.А. Медведева",
      "content": "Приход к власти В.В. Путина (1999–2000). Укрепление вертикали власти, реформа федеративных отношений, создание федеральных округов. Экономический рост в 2000-е (благоприятная внешнеэкономическая конъюнктура), социальные программы (национальные проекты). Внешняя политика: концепция многополярного мира, конфликты с Грузией (2008), Украиной (2014 – Крым, Донбасс), Сирией. Президентство Д.А. Медведева (2008–2012): модернизация, закон об увеличении срока президентских полномочий. Возвращение Путина на пост президента (2012). Поправки к Конституции 2020 г. Основные тенденции и проблемы современного этапа.",
      "keywords": ["Путин", "Медведев", "вертикаль власти", "Крым", "Конституция 2020"]
    },
    {
      "title": "Русская культура: от древности до наших дней",
      "content": "Основные этапы развития: культура Древней Руси (иконопись, летописание, зодчество), культура Московского царства (Андрей Рублёв, Дионисий, шатровое зодчество), культура XVIII в. (европеизация, барокко, классицизм, Ломоносов), «золотой век» русской культуры (XIX в.): литература (Пушкин, Гоголь, Толстой, Достоевский), музыка (Глинка, Чайковский), живопись (передвижники), архитектура. «Серебряный век» (конец XIX – начало XX): символизм, акмеизм, футуризм. Советская культура: авангард 1920-х, социалистический реализм, культура в годы войны, оттепель, диссидентское искусство. Постсоветская культура: многообразие стилей, влияние массовой культуры, развитие новых технологий.",
      "keywords": ["культура", "искусство", "литература", "золотой век", "серебряный век", "авангард"]
    }
  ]
}