{
  "topics": [
    {
      "title": "Основы C++",
      "content": "C++ — компилируемый язык программирования общего назначения. Поддерживает объектно-ориентированное, обобщённое и функциональное программирование. Структура программы: заголовочные файлы (#include), функция main(). Типы данных: int, float, double, char, bool. Операторы: арифметические, сравнения, логические. Управляющие конструкции: if, switch, for, while, do-while. Массивы, указатели, ссылки. Функции: объявление, определение, параметры (передача по значению и по ссылке), перегрузка функций.",
      "keywords": ["c++", "язык", "компиляция", "указатели"]
    },
    {
      "title": "Объектно-ориентированное программирование в C++",
      "content": "Классы и объекты. Инкапсуляция: public, private, protected. Конструкторы и деструкторы. Наследование (одиночное и множественное). Полиморфизм: виртуальные функции, абстрактные классы. Дружественные функции и классы. Перегрузка операторов. Шаблоны классов и функций. Стандартная библиотека шаблонов (STL): контейнеры (vector, list, map), итераторы, алгоритмы.",
      "keywords": ["ооп", "класс", "наследование", "полиморфизм", "stl"]
    },
    {
      "title": "Основы C#",
      "content": "C# — объектно-ориентированный язык от Microsoft, работающий на платформе .NET. Типы данных: значимые и ссылочные. Пространства имён. Свойства, индексаторы. Делегаты и события. LINQ (Language Integrated Query). Асинхронное программирование (async/await). Работа с исключениями (try-catch-finally). Windows Forms и WPF для создания GUI.",
      "keywords": ["c#", ".net", "linq", "делегаты"]
    },
    {
      "title": "Основы Python",
      "content": "Python — интерпретируемый язык с динамической типизацией. Прост в изучении, широко применяется в науке о данных, веб-разработке и автоматизации. Типы данных: числа, строки, списки, кортежи, множества, словари. Управляющие конструкции: if-elif-else, for, while. Функции: определение, аргументы (позиционные, именованные, *args, **kwargs). Модули и пакеты. Работа с файлами. ООП в Python: классы, наследование, магические методы. Исключения. Стандартная библиотека: os, sys, re, datetime, math, random. Популярные сторонние библиотеки: numpy, pandas, matplotlib, requests.",
      "keywords": ["python", "интерпретатор", "скриптинг", "numpy"]
    },
    {
      "title": "Алгоритмы и структуры данных (общее)",
      "content": "Базовые структуры данных: массивы, связные списки, стеки, очереди, деревья (бинарные, бинарные поиска, сбалансированные), хеш-таблицы, графы. Основные алгоритмы: сортировки (пузырьком, вставками, слиянием, быстрая, пирамидальная), поиск (линейный, бинарный), обход графов (BFS, DFS), алгоритмы на графах (Дейкстра, Флойд, Прима, Краскала). Понятие сложности O-большое.",
      "keywords": ["алгоритм", "структура данных", "сортировка", "сложность"]
    }
  ]
}